Catalogs/Фирмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Фирмы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗнаковКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗнаковЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗнаковЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПроизводитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСерия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСрокГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьВалютуЗакупкиВПеремещении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлениеСерийВПриходеВТранзакцииНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДопИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешатьИнтерактивныйВыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ХранилищеДопИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХранилищеДопИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительнойИнформацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Фирмы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
    Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
КонецПроцедуры         

 
&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
	    Возврат;
	КонецЕсли;
	
	АдресКартинки = Адрес;
	Модифицированность = Истина;
    
КонецПроцедуры





#Область ДействияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	//Элементы.ЦветаДолгиЦвет.ТолькоПросмотр = НЕ гоАдминистратор();
	//Элементы.ЦветаПредоплатыЦвет.ТолькоПросмотр = НЕ гоАдминистратор();
	//
	//// © Primus1C  12.08.2023  НАЧАЛО ►
	//ОтобразитьЦвет(); 
	//АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Логотип");   
	
	 Запр = Новый Запрос;
	 Запр.Текст = "ВЫБРАТЬ
	              |	ХранилищеДопИнформации.Ссылка КАК Ссылка
	              |ИЗ
	              |	Справочник.ХранилищеДопИнформации КАК ХранилищеДопИнформации
	              |ГДЕ
	              |	ХранилищеДопИнформации.Объект = &Объект
	              |	И ХранилищеДопИнформации.ВидДанных = &ВидДанных";
	 Запр.УстановитьПараметр("Объект", Объект.Ссылка);
	 Запр.УстановитьПараметр("ВидДанных", Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение);	
     Выборка = Запр.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		АдресКартинки =  ПолучитьНавигационнуюСсылку(Выборка.Ссылка); 
	КонецЕсли;          

	//// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры

 
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
	//НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);

КонецПроцедуры

   
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
	//    ТекущийОбъект.Логотип = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	//КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(АдресКартинки); 
		ТекущийОбъект.Логотип = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(АдресКартинки); 
		АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Логотип"); 
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	 Запр = Новый Запрос;
	 Запр.Текст = "ВЫБРАТЬ
	              |	ХранилищеДопИнформации.Ссылка КАК Ссылка
	              |ИЗ
	              |	Справочник.ХранилищеДопИнформации КАК ХранилищеДопИнформации
	              |ГДЕ
	              |	ХранилищеДопИнформации.Объект = &Объект
	              |	И ХранилищеДопИнформации.ВидДанных = &ВидДанных";
	 Запр.УстановитьПараметр("Объект", Объект.Ссылка);
	 Запр.УстановитьПараметр("ВидДанных", Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение);	
     Выборка = Запр.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
	 	спрХ = Выборка.Ссылка.ПолучитьОбъект();
	 Иначе
	 	спрХ = Справочники.ХранилищеДопИнформации.СоздатьЭлемент();
	 	спрХ.Объект = Объект.Ссылка;
	    спрХ.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
	КонецЕсли;  
	//ДанныеФайла = ЭтаФорма.АдресКартинки.пол.		
	// спрХ.Хранилище = Новый ХранилищеЗначения(АдресКартинки); 
	// спрх.Записать();
	 
КонецПроцедуры

#КонецОбласти




#Область СобытияЭлементовФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика. 
	СтандартнаяОбработка = Ложь;
	ЗагрузитьКартинку(Неопределено);
КонецПроцедуры

#КонецОбласти


#Область РаботаСФайлами  

&НаСервере
Функция АдресКартинки()

	мас = РегистрыСведений.ХранилищеФайлов.ПолучитьКлючЗаписи(Объект.Ссылка, Перечисления.НазначениеФайлов.Прочее);
	Если мас.ВГраница() = -1 Тогда
		Возврат Неопределено;
	Иначе	
		ОписаниеФайла = мас[0];
		Возврат ОписаниеФайла.ИмяФайла + ОписаниеФайла.РасширениеИменмФайла;	
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ДобавитьФайлЛого(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтаФорма, ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"));
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, ЭтотОбъект.УникальныйИдентификатор); 

КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	клДаНет(Новый ОписаниеОповещения("ОбработкаВыбораФайлаПослеЗаписи", ЭтотОбъект, 
			Новый Структура("Адрес, ВыбранноеИмяФайла, ДопПараметры", Адрес, ВыбранноеИмяФайла, ДопПараметры)),
		НСтр("ru = 'Фирма еще не записана. Записать и прикрепить файл?'; en = 'The Firm has not yet been saved. Record it and attach the file?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПослеЗаписи(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Записать();
	ОбработкаВыбораФайлаПрикрепить(Параметры.Адрес, Параметры.ВыбранноеИмяФайла, Параметры.ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры)
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			Сообщить(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	//ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, ВладелецФормы.Объект.Ссылка, Параметр,л_Отказ,,л_КлючЗаписи,л_Сообщение);
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, Объект.Ссылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		Оповестить("ОбновитьЛого", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры 

#КонецОбласти










//&НаСервере
//Процедура ЗаполнитьДолгиНаСервере()
//	Для Каждого Пер Из Перечисления.Долги Цикл
//		Нов = Объект.ЦветаДолги.Добавить();
//		Нов.Параметр = Пер;
//	КонецЦикла; 
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьДолги(Команда)
//	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
//	
//	Если Объект.ЦветаДолги.Количество() <> 0 Тогда Возврат КонецЕсли;
//	ЗаполнитьДолгиНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПредоплатыНаСервере()
//	Для Каждого Пер Из Перечисления.Предоплаты Цикл
//		Нов = Объект.ЦветаПредоплаты.Добавить();
//		Нов.Параметр = Пер;
//	КонецЦикла; 
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьПредоплаты(Команда)
//	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
//	
//	Если Объект.ЦветаПредоплаты.Количество() <> 0 Тогда Возврат КонецЕсли; 
//	ЗаполнитьПредоплатыНаСервере();
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветДолги(Команда)
//	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
//	Если Объект.ЦветаДолги.Количество() = 0 Тогда Возврат КонецЕсли; 
//	
//	Дан = Элементы.ЦветаДолги.ТекущиеДанные;
//	Если Дан = Неопределено Тогда Возврат КонецЕсли; 
//	
//	Стр = Объект.ЦветаДолги[Элементы.ЦветаДолги.ТекущаяСтрока];
//	
//	Кра = 0; 
//	Зел = 0;
//	Син = 0;
//	гоЦветОбратно(Стр.Цвет, Кра, Зел, Син);
//	
//	Диалог = Новый ДиалогВыбораЦвета;
//	Диалог.Цвет = Новый Цвет(Кра, Зел, Син);
//	Если НЕ Диалог.Выбрать() Тогда Возврат КонецЕсли;
//	НовЦвет = гоЦвет(Диалог.Цвет.Красный, Диалог.Цвет.Зеленый, Диалог.Цвет.Синий);
//	Если НовЦвет = Стр.Цвет Тогда Возврат КонецЕсли;
//	
//	Стр.Цвет = НовЦвет;
//	ЭтаФорма.Модифицированность = Истина;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветПредоплаты(Команда)
//	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
//	Если Объект.ЦветаПредоплаты.Количество() = 0 Тогда Возврат КонецЕсли; 
//	
//	Дан = Элементы.ЦветаПредоплаты.ТекущиеДанные;
//	Если Дан = Неопределено Тогда Возврат КонецЕсли; 
//	
//	Стр = Объект.ЦветаПредоплаты[Элементы.ЦветаПредоплаты.ТекущаяСтрока];
//	
//	Кра = 0; 
//	Зел = 0;
//	Син = 0;
//	гоЦветОбратно(Стр.Цвет, Кра, Зел, Син);
//	
//	Диалог = Новый ДиалогВыбораЦвета;
//	Диалог.Цвет = Новый Цвет(Кра, Зел, Син);
//	Если НЕ Диалог.Выбрать() Тогда Возврат КонецЕсли;
//	НовЦвет = гоЦвет(Диалог.Цвет.Красный, Диалог.Цвет.Зеленый, Диалог.Цвет.Синий);
//	Если НовЦвет = Стр.Цвет Тогда Возврат КонецЕсли;
//	
//	Стр.Цвет = НовЦвет;
//	ЭтаФорма.Модифицированность = Истина;
//КонецПроцедуры

// © Primus1C  12.08.2023  НАЧАЛО ►

//&НаКлиенте
//Процедура ЦветаПредоплатыЦветРГБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	УстановитьНовыйЦветКлиент(Элементы.ЦветаПредоплаты.ТекущиеДанные.ЦветРГБ, СтандартнаяОбработка);
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветаДолгиЦветРГБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	УстановитьНовыйЦветКлиент(Элементы.ЦветаДолги.ТекущиеДанные.ЦветРГБ, СтандартнаяОбработка);
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветаИнвойсыЦветРГБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	УстановитьНовыйЦветКлиент(Элементы.ЦветаИнвойсы.ТекущиеДанные.ЦветРГБ, СтандартнаяОбработка);
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьНовыйЦветКлиент(ТекущийЦвет, СтандартнаяОбработка)

//    ТекПараметры    = Новый Структура("ТекущийЦвет", ТекущийЦвет);
//    ВыбранныйЦвет   = ОткрытьФормуМодально("Обработка.ДиалогВыбораЦвета.Форма.Форма", ТекПараметры, ЭтаФорма);

//    Если Не ВыбранныйЦвет = Неопределено Тогда
//		  ТекущийЦвет = ВыбранныйЦвет; 
//    КонецЕсли;

//    СтандартнаяОбработка = Ложь;
//	
//	ОтобразитьЦвет();
//	
//КонецПроцедуры   

//&НаСервере
//Процедура ОтобразитьЦвет()
//	
//	УсловноеОформление.Элементы.Очистить();
//	СписПолей = Новый СписокЗначений;
//	СписПолей.Добавить("ЦветаДолги");
//	СписПолей.Добавить("ЦветаПредоплаты");
//	Для Каждого	ИмяПоля Из СписПолей Цикл 
//		
//		ФормаСписок = Элементы[ИмяПоля.Значение];
//		Для каждого СтрокаТЧ Из Объект[ИмяПоля.Значение] Цикл  
//			
//			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЦветРГБ) Тогда
//				Продолжить;	
//			КонецЕсли; 
//			
//			Эле = УсловноеОформление.Элементы.Добавить();
//			Эле.Использование = Истина;
//			Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(СтрокаТЧ.ЦветРГБ));
//			
//			Отб                = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			Отб.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект."+ИмяПоля.Значение+".ЦветРГБ");
//			Отб.ПравоеЗначение = СтрокаТЧ.ЦветРГБ; 
//			Отб.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//			Отб.Использование  = Истина;
//			
//			ОформляемоеПоле      = Эле.Поля.Элементы.Добавить();
//			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля.Значение);
//			
//		КонецЦикла;
//		
//	КонецЦикла;     
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветаИнвойсыПриИзменении(Элемент)
//	ОтобразитьЦвет()
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветаПредоплатыПриИзменении(Элемент)
//	ОтобразитьЦвет()
//КонецПроцедуры

//&НаКлиенте
//Процедура ЦветаДолгиПриИзменении(Элемент)
//	ОтобразитьЦвет()
//КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
